Revit 2023 API
ATFBaseExportOptions Properties
The ATFBaseExportOptions type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ViewId
 The element id of the 3D view to export. InvalidElementId by default.
See Also
ATFBaseExportOptions Class
Autodesk.Revit.DB Namespace